# 서울시 구별 CCTV 현황 분석

## 1.CCTV 현황과 인구 현황 데이터 다운로드

https://github.com/PinkWink/DataScience/tree/master/data

## 2.Python에서 텍스트 파일과 엑셀 파일 읽기

In [1]:
import pandas as pd

In [2]:
CCTV_Seoul = pd.read_csv('01. CCTV_in_Seoul.csv',encoding='utf-8')
#UTF-8로 인코딩 되어있는 데이터를 불러온다.
CCTV_Seoul.head()
#처음 다섯행만 보여준다.

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [3]:
CCTV_Seoul.columns #컬럼의 이름이 반환된다.

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [4]:
CCTV_Seoul.columns[0]#첫번째 컬럼의 이름을 반환한다.

'기관명'

In [5]:
#첫번째 컬럼의 이름을 '구별'로 바꾸어보기
#inplace=True는 변수명을 직접 변경한다는 것을 의미한다.
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0]:'구별'},inplace=True)
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [6]:
#두번째 받은 엑셀 파일 읽기
pop_Seoul=pd.read_excel('01. population_in_Seoul.xls',encoding='utf-8')
pop_Seoul.head()

,기간,자치구,세대,인구,인구.1,인구.2,인구.3,인구.4,인구.5,인구.6,인구.7,인구.8,세대당인구,65세이상고령자
0,기간,자치구,세대,합계,합계,합계,한국인,한국인,한국인,등록외국인,등록외국인,등록외국인,세대당인구,65세이상고령자
1,기간,자치구,세대,계,남자,여자,계,남자,여자,계,남자,여자,세대당인구,65세이상고령자
2,2017.1/4,합계,4202888,10197604,5000005,5197599,9926968,4871560,5055408,270636,128445,142191,2.36,1321458
3,2017.1/4,종로구,72654,162820,79675,83145,153589,75611,77978,9231,4064,5167,2.11,25425
4,2017.1/4,중구,59481,133240,65790,67450,124312,61656,62656,8928,4134,4794,2.09,20764

읽어온 파일의 행이 이상함.

In [7]:
#header=2로 지정하여 3번째 행이 data의 head가 되도록 변경
pop_Seoul = pd.read_excel('01. population_in_Seoul.xls', header=2, usecols='B,D,G,J,N',encoding='utf-8')
pop_Seoul.head()

   자치구           계        계.1       계.2   65세이상고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [8]:
#데이터의 특성을 파악하기 쉽도록 컬럼명 변경
pop_Seoul.rename(columns={pop_Seoul.columns[0]:'구별',
                         pop_Seoul.columns[1]:'인구수',
                         pop_Seoul.columns[2]:'한국인',
                         pop_Seoul.columns[3]:'외국인',
                         pop_Seoul.columns[4]:'고령자'},inplace=True)
pop_Seoul.head()

    구별         인구수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

## 3.Pandas 기초 익히기

### (1)Series와 DataFrame

In [9]:
import pandas as pd
import numpy as np

In [10]:
#Series는 pandas 데이터 유형 중 기본이다.
#대괄호를 이용하여 list를 만든 후 pd.Series 명령어를 이용하여 만들어 주었다.
s=pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [11]:
#data range를 이용하여 기준날짜로부터 6일간의 날짜를 구할 수 있다.
dates=pd.date_range('20130101',periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
#6행 4열의 random 변수를 만들고 컬럼을 A,B,C,D로 지정한다.
#행의 인덱스를 위에서 구해준 날짜로 지정해주자
df=pd.DataFrame(np.random.randn(6,4),index=dates,columns=['A','B','C','D'])
df

                   A         B         C         D
2013-01-01 -0.122693  1.362993 -0.894871  1.918842
2013-01-02  0.988601  0.104495 -0.975255  1.253889
2013-01-03 -0.427753 -0.992790  0.491897  0.711813
2013-01-04 -0.426952 -0.297343  0.418421  0.478449
2013-01-05  0.109397  0.344585  0.478557  1.001388
2013-01-06 -2.706571 -0.847411  0.974831  0.090833

In [13]:
#행의 인덱스 출력해보기
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [14]:
#컬럼명 확인하기
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [15]:
#위에서부터 3번째 행까지만 출력해서보기
df.head(3)

                   A         B         C         D
2013-01-01 -0.122693  1.362993 -0.894871  1.918842
2013-01-02  0.988601  0.104495 -0.975255  1.253889
2013-01-03 -0.427753 -0.992790  0.491897  0.711813

In [16]:
#내용 확인
df.values

array([[-0.12269311,  1.36299319, -0.89487108,  1.91884245],
       [ 0.98860089,  0.1044953 , -0.97525451,  1.25388903],
       [-0.42775284, -0.99278975,  0.49189725,  0.71181317],
       [-0.42695196, -0.29734329,  0.41842069,  0.47844878],
       [ 0.10939654,  0.3445853 ,  0.47855657,  1.00138831],
       [-2.70657103, -0.84741121,  0.97483108,  0.09083342]])

In [17]:
#DataFrame의 개요 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [18]:
#통계적 개요 확인
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.430995 -0.054245  0.082263  0.909203
std    1.231308  0.867399  0.813347  0.638893
min   -2.706571 -0.992790 -0.975255  0.090833
25%   -0.427553 -0.709894 -0.566548  0.536790
50%   -0.274823 -0.096424  0.448489  0.856601
75%    0.051374  0.284563  0.488562  1.190764
max    0.988601  1.362993  0.974831  1.918842

In [19]:
#B컬럼을 기준으로 데이터 정렬하기. 오름차순인 ascending=Ture가 default.
df.sort_values(by='B',ascending=False)

                   A         B         C         D
2013-01-01 -0.122693  1.362993 -0.894871  1.918842
2013-01-05  0.109397  0.344585  0.478557  1.001388
2013-01-02  0.988601  0.104495 -0.975255  1.253889
2013-01-04 -0.426952 -0.297343  0.418421  0.478449
2013-01-06 -2.706571 -0.847411  0.974831  0.090833
2013-01-03 -0.427753 -0.992790  0.491897  0.711813

In [20]:
#컬럼에 해당하는 Series 출력
df['A']

2013-01-01   -0.122693
2013-01-02    0.988601
2013-01-03   -0.427753
2013-01-04   -0.426952
2013-01-05    0.109397
2013-01-06   -2.706571
Freq: D, Name: A, dtype: float64

### (2)loc

In [21]:
#원하는 행의 범위를 지정해서 보기
df[0:3]

                   A         B         C         D
2013-01-01 -0.122693  1.362993 -0.894871  1.918842
2013-01-02  0.988601  0.104495 -0.975255  1.253889
2013-01-03 -0.427753 -0.992790  0.491897  0.711813

In [22]:
#인덱스를 이용해 행의 범위를 지정하기
df['2013-01-01':'2013-01-03']

                   A         B         C         D
2013-01-01 -0.122693  1.362993 -0.894871  1.918842
2013-01-02  0.988601  0.104495 -0.975255  1.253889
2013-01-03 -0.427753 -0.992790  0.491897  0.711813

In [23]:
#df.loc[]을 이용하여 특정 행의 데이터만 뽑아내기
df.loc[dates[1]]

A    0.988601
B    0.104495
C   -0.975255
D    1.253889
Name: 2013-01-02 00:00:00, dtype: float64

In [24]:
#모든 A와 B의 모든 행 뽑아내기
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.122693  1.362993
2013-01-02  0.988601  0.104495
2013-01-03 -0.427753 -0.992790
2013-01-04 -0.426952 -0.297343
2013-01-05  0.109397  0.344585
2013-01-06 -2.706571 -0.847411

In [25]:
#행과 열의 범위를 동시에 지정하기
df.loc['2013-01-01':'2013-01-03',['A','B']]

                   A         B
2013-01-01 -0.122693  1.362993
2013-01-02  0.988601  0.104495
2013-01-03 -0.427753 -0.992790

In [27]:
#2013년 1월 3일의 A,B 컬럼 확인하기
df.loc['2013-01-03',['A','B']]

A   -0.427753
B   -0.992790
Name: 2013-01-03 00:00:00, dtype: float64

In [28]:
#dates[0]에 해당하는 날짜의 A컬럼 데이터 확인하기
df.loc[dates[0],'A']

-0.12269311416600379

### (3)iloc

In [29]:
#행과 열의 인덱스를 이용하여 데이터에 바로 접근하기
df.iloc[2]

A   -0.427753
B   -0.992790
C    0.491897
D    0.711813
Name: 2013-01-03 00:00:00, dtype: float64

In [30]:
#2부터 (4-1)까지의 행과 0부터 2까지의 컬럼 뽑아내기
df.iloc[2:4,0:2]

                   A         B
2013-01-03 -0.427753 -0.992790
2013-01-04 -0.426952 -0.297343

In [31]:
#:을 이용한 범위 지정이 아닌 ,를 이용해 원하는 항목 지정하기
df.iloc[[1,3,4],[0,3]]

                   A         D
2013-01-02  0.988601  1.253889
2013-01-04 -0.426952  0.478449
2013-01-05  0.109397  1.001388

In [32]:
#:는 전체범위를 의미함. 모든 행을 출력하기
df.iloc[:,[1,3]]

                   B         D
2013-01-01  1.362993  1.918842
2013-01-02  0.104495  1.253889
2013-01-03 -0.992790  0.711813
2013-01-04 -0.297343  0.478449
2013-01-05  0.344585  1.001388
2013-01-06 -0.847411  0.090833

In [33]:
#모든 컬럼 출력하기
df.iloc[[0,3,4],:]

                   A         B         C         D
2013-01-01 -0.122693  1.362993 -0.894871  1.918842
2013-01-04 -0.426952 -0.297343  0.418421  0.478449
2013-01-05  0.109397  0.344585  0.478557  1.001388

### (4)조건문

In [34]:
df

                   A         B         C         D
2013-01-01 -0.122693  1.362993 -0.894871  1.918842
2013-01-02  0.988601  0.104495 -0.975255  1.253889
2013-01-03 -0.427753 -0.992790  0.491897  0.711813
2013-01-04 -0.426952 -0.297343  0.418421  0.478449
2013-01-05  0.109397  0.344585  0.478557  1.001388
2013-01-06 -2.706571 -0.847411  0.974831  0.090833

In [35]:
#A컬럼에서 0보다 큰 행만 출력하기
df[df.A>0]

                   A         B         C         D
2013-01-02  0.988601  0.104495 -0.975255  1.253889
2013-01-05  0.109397  0.344585  0.478557  1.001388

In [36]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN  1.362993       NaN  1.918842
2013-01-02  0.988601  0.104495       NaN  1.253889
2013-01-03       NaN       NaN  0.491897  0.711813
2013-01-04       NaN       NaN  0.418421  0.478449
2013-01-05  0.109397  0.344585  0.478557  1.001388
2013-01-06       NaN       NaN  0.974831  0.090833

In [37]:
#데이터의 원본을 바꾸고 싶지 않을때 copy 명령어 사용하기
df2=df.copy()

In [38]:
#E 컬럼 새로 추가하고 
df2['E']=['one','two','three','four','five','six']
df2

                   A         B         C         D      E
2013-01-01 -0.122693  1.362993 -0.894871  1.918842    one
2013-01-02  0.988601  0.104495 -0.975255  1.253889    two
2013-01-03 -0.427753 -0.992790  0.491897  0.711813  three
2013-01-04 -0.426952 -0.297343  0.418421  0.478449   four
2013-01-05  0.109397  0.344585  0.478557  1.001388   five
2013-01-06 -2.706571 -0.847411  0.974831  0.090833    six

In [39]:
#isin 명령어를 이용해 'two'와 'five'가 E 컬럼에 있는지 확인하기
df2['E'].isin(['two','five'])

2013-01-01    False
2013-01-02     True
2013-01-03    False
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [40]:
#'two'와 'five'가 있는 행만 출력하기
df2[df2['E'].isin(['two','five'])]

                   A         B         C         D     E
2013-01-02  0.988601  0.104495 -0.975255  1.253889   two
2013-01-05  0.109397  0.344585  0.478557  1.001388  five

### (5)cumsum

In [41]:
#데이터 자체에 조건을 걸면 조건문에 만족하지 못하는 곳은 NaN 처리 됨
df[df>0]

                   A         B         C         D
2013-01-01       NaN  1.362993       NaN  1.918842
2013-01-02  0.988601  0.104495       NaN  1.253889
2013-01-03       NaN       NaN  0.491897  0.711813
2013-01-04       NaN       NaN  0.418421  0.478449
2013-01-05  0.109397  0.344585  0.478557  1.001388
2013-01-06       NaN       NaN  0.974831  0.090833

In [42]:
df

                   A         B         C         D
2013-01-01 -0.122693  1.362993 -0.894871  1.918842
2013-01-02  0.988601  0.104495 -0.975255  1.253889
2013-01-03 -0.427753 -0.992790  0.491897  0.711813
2013-01-04 -0.426952 -0.297343  0.418421  0.478449
2013-01-05  0.109397  0.344585  0.478557  1.001388
2013-01-06 -2.706571 -0.847411  0.974831  0.090833

In [43]:
#각 컬럼에 대해 누적합 구하기
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01 -0.122693  1.362993 -0.894871  1.918842
2013-01-02  0.865908  1.467488 -1.870126  3.172731
2013-01-03  0.438155  0.474699 -1.378228  3.884545
2013-01-04  0.011203  0.177355 -0.959808  4.362993
2013-01-05  0.120600  0.521941 -0.481251  5.364382
2013-01-06 -2.585972 -0.325470  0.493580  5.455215

### (6)lamda

In [44]:
#최대값과 최소값의 차이 구하기
df.apply(lambda x: x.max()-x.min())

A    3.695172
B    2.355783
C    1.950086
D    1.828009
dtype: float64

## 4.Pandas 이용해서 CCTV와 인구 현황 데이터 파악하기

In [45]:
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [46]:
#소계를 기준으로 정렬하기 
CCTV_Seoul.sort_values(by='소계',ascending=True).head()

     구별   소계  2013년도 이전  2014년  2015년  2016년
9   도봉구  485        238    159     42    386
12  마포구  574        314    118    169    379
17  송파구  618        529     21     68    463
24  중랑구  660        509    121    177    109
23   중구  671        413    190     72    348

CCTV의 전체 개수가 가장 적은 구가 도봉구,마포구,송파구,중랑구,중구임을 알 수 있다.

In [47]:
CCTV_Seoul.sort_values(by='소계', ascending=False).head()

     구별    소계  2013년도 이전  2014년  2015년  2016년
0   강남구  2780       1292    430    584    932
18  양천구  2034       1843    142     30    467
14  서초구  1930       1406    157    336    398
21  은평구  1873       1138    224    278    468
20  용산구  1624       1368    218    112    398

CCTV의 전체 수가 가장 많은 구는 강남구, 양천구, 서초구, 은평구, 용산구임을 알 수 있다.

In [48]:
#2013년 이전대비 2014-2016년 CCTV 증가율 구하기
CCTV_Seoul['2014년']

#CCTV_Seoul['증가율']=((CCTV_Seoul['2014년']+CCTV_Seoul['2015년']+CCTV_Seoul['2016년'])/CCTV_Seoul['2013년도 이전']*100)

0     430
1      99
2     120
3     258
4     260
5      78
6     173
7      51
8      57
9     159
10     23
11    341
12    118
13     50
14    157
15     91
16     78
17     21
18    142
19    214
20    218
21    224
22    314
23    190
24    121
Name: 2014년, dtype: int64

In [49]:
#서울시 인구 현황
pop_Seoul.head()

    구별         인구수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [50]:
#합계는 필요 없기 때문에 drop하기로 한다.
pop_Seoul.drop([0], inplace=True)
pop_Seoul.head()

    구별       인구수       한국인      외국인      고령자
1  종로구  162820.0  153589.0   9231.0  25425.0
2   중구  133240.0  124312.0   8928.0  20764.0
3  용산구  244203.0  229456.0  14747.0  36231.0
4  성동구  311244.0  303380.0   7864.0  39997.0
5  광진구  372164.0  357211.0  14953.0  42214.0

In [52]:
pop_Seoul['구별'].unique()

array(['종로구', '중구', '용산구', '성동구', '광진구', '동대문구', '중랑구', '성북구', '강북구',
       '도봉구', '노원구', '은평구', '서대문구', '마포구', '양천구', '강서구', '구로구', '금천구',
       '영등포구', '동작구', '관악구', '서초구', '강남구', '송파구', '강동구', nan],
      dtype=object)

마지막 나열값에 nan이 보임. nan의 행이 어떻게 되어있는지 확인해보자

In [54]:
#isnull 명령어를 이용하여 결측값 확인하기
pop_Seoul[pop_Seoul['구별'].isnull()]

     구별  인구수  한국인  외국인  고령자
26  NaN  NaN  NaN  NaN  NaN

In [57]:
#NaN에 해당하는 행을 삭제하기
pop_Seoul.drop([26], inplace=True)

In [58]:
#'외국인비율'과 '고령자비율'을 계산해보자
pop_Seoul['외국인비율']=pop_Seoul['외국인']/pop_Seoul['인구수']*100
pop_Seoul['고령자비율']=pop_Seoul['고령자']/pop_Seoul['인구수']*100
pop_Seoul.head()

    구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
1  종로구  162820.0  153589.0   9231.0  25425.0  5.669451  15.615404
2   중구  133240.0  124312.0   8928.0  20764.0  6.700690  15.583909
3  용산구  244203.0  229456.0  14747.0  36231.0  6.038828  14.836427
4  성동구  311244.0  303380.0   7864.0  39997.0  2.526635  12.850689
5  광진구  372164.0  357211.0  14953.0  42214.0  4.017852  11.342849

In [60]:
#내림차순으로 인구수 정렬
pop_Seoul.sort_values(by='인구수', ascending=False).head()

     구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
24  송파구  667483.0  660584.0   6899.0  72506.0  1.033584  10.862599
16  강서구  603772.0  597248.0   6524.0  72548.0  1.080540  12.015794
23  강남구  570500.0  565550.0   4950.0  63167.0  0.867660  11.072217
11  노원구  569384.0  565565.0   3819.0  71941.0  0.670725  12.634883
21  관악구  525515.0  507203.0  18312.0  68082.0  3.484582  12.955291

인구수가 많은 순은 송파구, 강서구, 강남구, 노원구, 관악구 순이라는 것을 알 수 있다.

In [63]:
#내림차순으로 외국인 수 정렬
pop_Seoul.sort_values(by='외국인', ascending=False).head()

      구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
19  영등포구  402985.0  368072.0  34913.0  52413.0  8.663598  13.006191
17   구로구  447874.0  416487.0  31387.0  56833.0  7.007998  12.689506
18   금천구  255082.0  236353.0  18729.0  32970.0  7.342345  12.925255
21   관악구  525515.0  507203.0  18312.0  68082.0  3.484582  12.955291
6   동대문구  369496.0  354079.0  15417.0  54173.0  4.172440  14.661322

외국인 수가 많은 구는 영등포구, 구로구, 금천구, 관악구, 동대문구 순이라는 것을 알 수 있다.

In [66]:
#내림차순으로 외국인비율 정렬
pop_Seoul.sort_values(by='외국인비율',ascending=False).head()

      구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
19  영등포구  402985.0  368072.0  34913.0  52413.0  8.663598  13.006191
18   금천구  255082.0  236353.0  18729.0  32970.0  7.342345  12.925255
17   구로구  447874.0  416487.0  31387.0  56833.0  7.007998  12.689506
2     중구  133240.0  124312.0   8928.0  20764.0  6.700690  15.583909
3    용산구  244203.0  229456.0  14747.0  36231.0  6.038828  14.836427

외국인 비율이 높은 구는 영등포구, 금천구, 구로구, 중구, 용산구 순서임을 알 수 있다.

이제 고령자와 고령자 비율을 조사해보자

In [69]:
#고령자 수 정렬
pop_Seoul.sort_values(by='고령자',ascending=False).head()

     구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
16  강서구  603772.0  597248.0   6524.0  72548.0  1.080540  12.015794
24  송파구  667483.0  660584.0   6899.0  72506.0  1.033584  10.862599
12  은평구  494388.0  489943.0   4445.0  72334.0  0.899091  14.631019
11  노원구  569384.0  565565.0   3819.0  71941.0  0.670725  12.634883
21  관악구  525515.0  507203.0  18312.0  68082.0  3.484582  12.955291

고령자가 많은 구는 강서구, 송파구, 은평구, 노원구, 관악구이다.

In [72]:
#고령자 비율 정렬
pop_Seoul.sort_values(by='고령자비율',ascending=False).head()

      구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
9    강북구  330192.0  326686.0   3506.0  54813.0  1.061806  16.600342
1    종로구  162820.0  153589.0   9231.0  25425.0  5.669451  15.615404
2     중구  133240.0  124312.0   8928.0  20764.0  6.700690  15.583909
3    용산구  244203.0  229456.0  14747.0  36231.0  6.038828  14.836427
13  서대문구  327163.0  314982.0  12181.0  48161.0  3.723221  14.720797

고령자 비율이 높은 곳은 강북구, 종로구, 중구, 용산구, 서대문구 순으로 
고령자 수의 순위와는 차이가 난다는 것을 알 수 있다.